frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l4/include/component/hmatrixb.h
/** \brief HmatrixbScfg hardware registers */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
 struct {
  __IO HMATRIXB_SCFG_Type        SCFG;        /**< \brief Offset: 0x000 (R/W 32) Slave Configuration Register */
 } bf;
 struct {
  RwReg   HMATRIXB_SCFG;      /**< \brief (HMATRIXB Offset: 0x000) Slave Configuration Register */
 } reg;
} HmatrixbScfg;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/** \brief HmatrixbSfr hardware registers */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
 struct {
  __IO HMATRIXB_SFR_Type         SFR;         /**< \brief Offset: 0x000 (R/W 32) Special Function Register */
 } bf;
 struct {
  RwReg   HMATRIXB_SFR;       /**< \brief (HMATRIXB Offset: 0x000) Special Function Register */
 } reg;
} HmatrixbSfr;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/** \brief HMATRIXB hardware registers */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
 struct {
       HmatrixbMcfg              Mcfg[16];    /**< \brief Offset: 0x000 HmatrixbMcfg groups */
       HmatrixbScfg              Scfg[16];    /**< \brief Offset: 0x040 HmatrixbScfg groups */
       HmatrixbPrs               Prs[16];     /**< \brief Offset: 0x080 HmatrixbPrs groups */
  __IO HMATRIXB_MRCR_Type        MRCR;        /**< \brief Offset: 0x100 (R/W 32) Master Remap Control Register */
       RoReg8                    Reserved1[0xC];
       HmatrixbSfr               Sfr[16];     /**< \brief Offset: 0x110 HmatrixbSfr groups */
 } bf;
 struct {
  HmatrixbMcfg HMATRIXB_MCFG[16];  /**< \brief (HMATRIXB Offset: 0x000) HmatrixbMcfg groups */
  HmatrixbScfg HMATRIXB_SCFG[16];  /**< \brief (HMATRIXB Offset: 0x040) HmatrixbScfg groups */
  HmatrixbPrs HMATRIXB_PRS[16];   /**< \brief (HMATRIXB Offset: 0x080) HmatrixbPrs groups */
  RwReg   HMATRIXB_MRCR;      /**< \brief (HMATRIXB Offset: 0x100) Master Remap Control Register */
  RoReg8  Reserved2[0xC];
  HmatrixbSfr HMATRIXB_SFR[16];   /**< \brief (HMATRIXB Offset: 0x110) HmatrixbSfr groups */
 } reg;
} Hmatrixb;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/*@}*/

#endif /* _SAM4L_HMATRIXB_COMPONENT_ */
